practice-for-ch-rails-first-routes-long-practice-main/practice-for-ch-rails-first-routes-long-practice-main/first/app/controllers/users_controller.rb

    def index
        # render plain:"index_action"
        @users = User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.new(params.require(:user).permit(:name, :email))

            if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Katie"], ["email", "katie@gmail"], ["created_at", "2024-04-10 22:04:32.591086"], ["updated_at", "2024-04-10 22:04:32.591086"]]

    def update

        @user = User.find(params[:id])

        if @user.update(params.require(:user).permit(:name, :email))
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Rafael"], ["email", "rafa@gmail"], ["updated_at", "2024-04-10 22:08:46.414567"], ["id", 1]]